homework_3/homework_3.org
#+TITLE: Homework 3
#+AUTHOR: Matthew Lundquist

** Question 1
Exercises 5.1, 5.2, 5.3, 5.4, 5.5, 5.7
5.8, 5.10, 5.12, 5.13, 5.14

5.1
#+BEGIN_SRC R :session :results output 
## a
3 * 2 # 6
## b
combos <- c("HG","HP", "MG", "MP", "LG", "LP") 
#+END_SRC

#+RESULTS:
: [1] 6

5.2
#+BEGIN_SRC R :session :results output 

3 * 4 * 2 ## 24

#+END_SRC

5.3
#+BEGIN_SRC R :session :results output 

2^23 # 8,388,608 gametes

#+END_SRC

#+RESULTS:
: [1] 8388608

5.4
#+BEGIN_SRC R :session :results output 

## 5_P_5
factorial(5) # 120

#+END_SRC

#+RESULTS:
: [1] 120

5.5
#+BEGIN_SRC R :session :results output 

## 12_P_5
factorial(12) / factorial(12-5) # 95,040

#+END_SRC

#+RESULTS:
: [1] 95040

5.7
#+BEGIN_SRC R :session :results output 

## n_C_x
## 9_C_5
factorial(9) / (factorial(5) * factorial(9-5)) # 126


#+END_SRC

#+RESULTS:
: [1] 126

5.8
#+BEGIN_SRC R :session :results output 

O <- 2672/5400 # 0.49
A <- 0.38
B <- 0.09
AB <- 0.04

#+END_SRC

#+RESULTS:

5.10
#+BEGIN_SRC R :session :results output 

## a P(A)
A # 0.38

## b P(A or AB) = P(A) + P(AB)
A + AB # 0.42
#+END_SRC

#+RESULTS:
: [1] 0.38
: [1] 0.42

5.12
#+BEGIN_SRC R :session :results output 

## You can check your answers using a Punnett Square

## a
## P(A and a)
PAa <- 0.5 * 1 # 0.5

## b
## P(a and a) 
Paa <- 0.5 * 1 # 0.5

## c
## P(A and A)
PAA <- 0.5 * 0 # 0

#+END_SRC

#+RESULTS:

5.13
#+BEGIN_SRC R :session :results output 

## deck = 52

## a
## P(Q of clubs)
PQC <- (1/4) * (1/13) # 0.0192

## b
## P(Black Queen) 
QBC <- (1/2) * (1/13) # 0.0384

## c
## P(Black Face Card)
PBFC <- (1/2) * (3/13) # 0.1153

#+END_SRC

#+RESULTS:
: [1] 0.03846154
: [1] 0.1153846


5.14
#+BEGIN_SRC R :session :results output 

## 2 W, 4 B
## 2 W, 2 B
## 3 W, 2 B

## a
## P(WWW)
PWWW <- (2/6) * (2/4) * (3/5) ## 0.1000

## b
## P(exactly 2W)
P2W <- (2/6 * 2/4 * 2/5) + (2/6 * 2/4 * 3/5) + (4/6 * 2/4 * 3/5) # 0.3667
P2W
## c
## P(at least 2W)
PAL2W <- 0.3667 + 0.10 # 0.4667
#+END_SRC

#+RESULTS:
: [1] 0.3666667
: [1] 0.4667

** Question 2

24.1
#+BEGIN_SRC R :session :results output 

P2 <- factorial(6) / (factorial(2) * factorial(4)) * (0.3)^2 * (0.7)^4 # 0.3241

## or 

dbinom(2, size = 6, prob = 0.3)

#+END_SRC

#+RESULTS:
: [1] 0.324135

24.2
#+BEGIN_SRC R :session :results output 

P2 <- factorial(5) / (factorial(4) * factorial(1)) * (0.22)^4 * (0.78)^1 # 0.0091

## or 

dbinom(4, size = 5, prob = 0.22)

#+END_SRC

#+RESULTS:
: [1] 0.009135984

** Question 3

In a pool of balls, 30% are red balls and 70% are blue balls. 
You are asked to pick 10 balls, what is the probability of getting 
3 red balls and 7 blue balls? What is the probability of getting 
5 red balls and 5 blue balls? What is the probability of 
getting more than 3 red balls? 

#+BEGIN_SRC R :session :results output 

## A
P1 <- factorial(10) / (factorial(3) * factorial(7)) * (0.3)^3 * (0.7)^7 # 0.2668

## or 

dbinom(3, size = 10, prob = 0.3)

## B
P2 <- factorial(10) / (factorial(5) * factorial(5)) * (0.3)^5 * (0.7)^5 # 0.1029

## or 

dbinom(5, size = 10, prob = 0.3)

## A
P3 <- 1 - (factorial(10) / (factorial(3) * factorial(7)) * (0.3)^3 * (0.7)^7) -
      (factorial(10) / (factorial(2) * factorial(8)) * (0.3)^2 * (0.7)^8) -
      (factorial(10) / (factorial(1) * factorial(9)) * (0.3)^1 * (0.7)^9) -
      (factorial(10) / (factorial(0) * factorial(10)) * (0.3)^0 * (0.7)^10) # 0.3504

## or 
 
1 - dbinom(3, size = 10, prob = 0.3) - dbinom(2, size = 10, prob = 0.3) - dbinom(1, size = 10, prob = 0.3) - dbinom(0, size = 10, prob = 0.3)
 

#+END_SRC

#+RESULTS:
: [1] 0.2668279
: [1] 0.1029193
: [1] 0.3503893


